[
    {
      "id": 1,
      "name": "Mad Max",
      "description": "Mad Max is a dystopian action film set in a post-apocalyptic world where a lone policeman, Max Rockatansky, seeks vengeance against a brutal biker gang after they kill his family. Imitation"
    },
    {
      "id": 2,
      "name": "The Imitation Game",
      "description": "The Imitation Game is a biographical drama that portrays the life of Alan Turing, a brilliant mathematician, and his team's efforts to crack the German Enigma code during World War II, ultimately contributing to Allied victory."
    },
    {
      "id": 3,
      "name": "The Shawshank Redemption",
      "description": "The Shawshank Redemption is a powerful drama that follows the story of Andy Dufresne, a banker wrongfully convicted of murder, as he forms friendships and navigates the brutal realities of prison life while maintaining hope and resilience."
    },
    {
      "id": 4,
      "name": "Inception",
      "description": "Inception is a mind-bending science fiction thriller that delves into the world of dream infiltration, as a skilled thief navigates through layers of subconsciousness to plant an idea into the mind of a corporate executive."
    },
    {
      "id": 5,
      "name": "Fight Club",
      "description": "Fight Club is a psychological drama that follows an insomniac office worker who forms an underground fight club as a form of therapy, but things spiral out of control as the club evolves into something much more dangerous."
    },
    {
      "id": 6,
      "name": "Saving Private Ryan",
      "description": "Saving Private Ryan is a gripping war film that follows a group of soldiers as they embark on a dangerous mission to rescue a paratrooper behind enemy lines during World War II, showcasing the brutal realities of war."
    },
    {
      "id": 7,
      "name": "Parasite",
      "description": "Parasite is a darkly comedic thriller that explores class discrimination through the intertwined lives of two families—one wealthy and the other poor—leading to unexpected and shocking outcomes."
    },
    {
      "id": 8,
      "name": "Django Unchained",
      "description": "Django Unchained is a Western film that follows a freed slave turned bounty hunter who sets out to rescue his wife from a brutal Mississippi plantation owner with the help of a German bounty hunter."
    },
    {
      "id": 9,
      "name": "Se7en",
      "description": "Se7en is a psychological thriller that follows two detectives as they track down a serial killer who commits murders based on the seven deadly sins, leading to a chilling and unforgettable climax."
    },
    {
      "id": 10,
      "name": "Spirited Away",
      "description": "Spirited Away is an enchanting animated film that follows a young girl who finds herself trapped in a mysterious and magical world, where she must navigate through various challenges to rescue her parents and return home."
    },
    {
      "id": 11,
      "name": "Jurassic Park",
      "description": "Jurassic Park is a thrilling adventure film that follows a group of scientists and tourists as they visit a remote island populated by genetically engineered dinosaurs, only to find themselves fighting for survival when the dinosaurs escape."
    },
    {
      "id": 12,
      "name": "Finding Nemo",
      "description": "Finding Nemo is a heartwarming animated film that follows a clownfish named Marlin as he embarks on a journey across the ocean to find his son Nemo, who has been captured by a diver and placed in a fish tank."
    },
    {
      "id": 13,
      "name": "The Hobbit: An Unexpected Journey",
      "description": "The Hobbit: An Unexpected Journey is a fantasy adventure film that follows the hobbit Bilbo Baggins as he sets out on a quest to reclaim the lost Dwarf Kingdom of Erebor from the dragon Smaug, encountering danger and adventure along the way."
    },
    {
      "id": 14,
      "name": "Shutter Island",
      "description": "Shutter Island is a psychological thriller that follows a U.S. Marshal as he investigates the disappearance of a patient from a remote mental institution, only to uncover dark secrets that lead to a shocking and mind-bending conclusion."
    },
    {
      "id": 15,
      "name": "The Godfather",
      "description": "A crime film that focuses on the powerful Italian-American crime family of Don Vito Corleone. When the don's youngest son, Michael, reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal."
    },
    {
      "id": 16,
      "name": "Schindler's List",
      "description": "In this historical drama, German businessman Oskar Schindler becomes an unlikely humanitarian, spending his entire fortune to help save 1,100 Jews from Auschwitz during World War II."
    },
    {
      "id": 17,
      "name": "Pulp Fiction",
      "description": "A crime drama featuring multiple stories of crime in Los Angeles, including a hitman's pursuit of redemption, a boxer's quest for freedom, and a pair of diner bandits' attempt at a big score."
    },
    {
      "id": 18,
      "name": "Goodfellas",
      "description": "A film that chronicles the rise and fall of mob associate Henry Hill and his friends over a period from 1955 to 1980, offering a detailed portrait of the Mafia's presence in American life. Mad Max"
    },
    {
      "id": 19,
      "name": "Seven Samurai",
      "description": "A classic Japanese film that tells the story of a village of farmers that hire seven ronin (masterless samurai) to combat bandits who will return after the harvest to steal their crops."
    },
    {
      "id": 20,
      "name": "The Silence of the Lambs",
      "description": "A thriller in which a young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims."
    },
    {
      "id": 21,
      "name": "The Prestige",
      "description": "Two rival magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other."
    },
    {
      "id": 22,
      "name": "Whiplash",
      "description": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at (Hobbit) nothing to realize a student's potential."
    },
    {
      "id": 23,
      "name": "WALL·E",
      "description": "In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind."
    },
    {
      "id": 24,
      "name": "Avengers: Infinity War",
      "description": "The Avengers and their allies must be willing to sacrifice all in an attempt to defeat the powerful Thanos before his blitz of devastation and ruin puts an end to the universe."
    },
    {
      "id": 25,
      "name": "The Dark Knight Rises",
      "description": "Eight years after the Joker's reign of anarchy, Batman, with the help of the enigmatic Catwoman, is forced from his exile to save Gotham City from the brutal guerrilla terrorist Bane."
    },
    {
      "id": 26,
      "name": "Toy Story",
      "description": "A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room. Joker"
    },
    {
      "id": 27,
      "name": "Braveheart",
      "description": "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England."
    },
    {
      "id": 28,
      "name": "Joker",
      "description": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He then embarks on a downward spiral of revolution and bloody crime. This path brings him face-to-face with his alter-ego: the Joker."
    },
    {
      "id": 29,
      "name": "Dune",
      "description": "A noble family becomes embroiled in a war for control over the galaxy's most valuable asset while its heir becomes troubled by visions of a dark future."
    },
    {
      "id": 30,
      "name": "3 Idiots",
      "description": "Two friends are searching for their long lost companion. They revisit their college days and recall the memories of their friend who inspired them to think differently, even as the rest of the world called them \"idiots.\" Joker"
    },
    {
      "id": 31,
      "name": "The Hunt",
      "description": "A teacher lives a lonely life, all the while struggling over his son's custody. His life slowly gets better as he finds love and receives good news from his son, but his new luck is about to be brutally shattered by an innocent little lie."
    },
    {
      "id": 32,
      "name": "Lawrence of Arabia",
      "description": "The story of T.E. Lawrence, the English officer who successfully united and led the diverse, often warring, Arab tribes during World War I in order to fight the Turks."
    },
    {
      "id": 33,
      "name": "Up",
      "description": "Seventy-eight-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway, and together they embark on an adventure of a lifetime."
    },
    {
      "id": 34,
      "name": "Indiana Jones and the Last Crusade",
      "description": "In 1938, after his father Professor Henry Jones, Sr. goes missing while pursuing the Holy Grail, Indiana Jones finds himself up against Adolf Hitler's Nazis again to stop them from obtaining its powers."
    },
    {
      "id": 35,
      "name": "1917",
      "description": "During World War I, two British soldiers are sent to deliver an urgent message to an isolated regiment. If the message is not received in time, the regiment will walk into a trap and be massacred."
    },
    {
      "id": 36,
      "name": "Taxi Driver",
      "description": "A mentally unstable Vietnam War veteran works as a nighttime taxi driver in New York City where the perceived decadence and sleaze feed his urge for violent action, attempting to save a preadolescent prostitute in the process."
    },
    {
      "id": 37,
      "name": "Dangal",
      "description": "Former wrestler Mahavir Singh Phogat and his two wrestler daughters struggle towards glory at the Commonwealth Games in the face of societal oppression."
    },
    {
      "id": 38,
      "name": "A Beautiful Mind",
      "description": "After John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish as he develops schizophrenia."
    },
    {
      "id": 39,
      "name": "King's Speech",
      "description": "The story of King George VI of the United Kingdom of Great Britain and Northern Ireland, his impromptu ascension to the throne and the speech therapist who helped the unsure monarch overcome his stammer."
    },
    {
      "id": 40,
      "name": "Prisoners",
      "description": "When Keller Dover's daughter and her friend go missing, he takes matters into his own hands as the police pursue multiple leads and the pressure mounts. But just how far will this desperate father go to protect his family?"
    },
    {
      "id": 41,
      "name": "Inside Out",
      "description": "Young Riley is uprooted from her Midwest life when her father starts a new job in San Francisco. Riley's guided by her emotions: Joy, Fear, Anger, Disgust, and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life."
    },
    {
      "id": 42,
      "name": "Fargo",
      "description": "Jerry Lundegaard's inept crime falls apart due to his and his henchmen's bungling and the persistent police work of the quite pregnant Marge Gunderson."
    },
    {
      "id": 43,
      "name": "Catch Me If You Can",
      "description": "A seasoned FBI agent pursues Frank Abagnale Jr. who, before his 19th birthday, successfully forged millions of dollars' worth of checks while posing as a Pan Am pilot, a doctor, and a legal prosecutor."
    },
    {
      "id": 44,
      "name": "Godzilla Minus One",
      "description": "Japan has barely recovered from the Second World War when a gigantic peril emerges off the coast of Tokyo. Koichi, a deserter traumatised by his first confrontation with Godzilla, sees this as an opportunity to redeem his conduct during the war."
    },
    {
      "id": 45,
      "name": "My Neighbor Totoro",
      "description": "When two girls move to the country to be near their ailing mother (Speech), they have adventures with the wondrous forest spirits who live nearby."
    },
    {
      "id": 46,
      "name": "Blade Runner",
      "description": "A blade runner must pursue and terminate four replicants who stole a ship in space, and have returned to Earth to find their creator."
    },
    {
      "id": 47,
      "name": "The Grand Budapest Hotel",
      "description": "The adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend."
    },
    {
      "id": 48,
      "name": "Room",
      "description": "Held captive for 7 years in an enclosed space, a woman and her young son finally gain their freedom, allowing the boy to experience the outside world for the first time."
    },
    {
      "id": 49,
      "name": "Ford v Ferrari",
      "description": "American car designer Carroll Shelby and driver Ken Miles battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford and challenge Ferrari at the 24 Hours of Le Mans in 1966."
    },

    {
      "id": 50,
      "name": "There Will Be Blood",
      "description": "A story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business."
    }
  ]
